Revit 2024 API
DuctFittingAndAccessoryPressureDropUIData Class
 The input and output data used by external UI servers for storing UI settings.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DuctFittingAndAccessoryPressureDropUIData : IDisposable
Visual Basic
Public Class DuctFittingAndAccessoryPressureDropUIData _
	Implements IDisposable
Visual C++
public ref class DuctFittingAndAccessoryPressureDropUIData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData
See Also
DuctFittingAndAccessoryPressureDropUIData Members
Autodesk.Revit.UI.Mechanical Namespace